# Rebar Container Item Set From Curves And Shape Method

Source: https://www.revitapidocs.com/2026/81e6f54b-0660-1d4c-92e4-20ade9e71c9d.htm

---

| Rebar Container Item Set From Curves And Shape Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation) | **Obsolete.** |
|  | SetFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarTerminationOrientation, RebarTerminationOrientation) |  |

Top See Also

#### Reference

RebarContainerItem Class Autodesk.Revit.DB.Structure Namespace